import pytest
from task_two import two_sum

@pytest.mark.parametrize(
    "lst, expected_result",
    [
        # Базовый случай: несколько элементов
        ([9, 1, 4, 1, 5, 10, 2, 9, 4], (2, 8)),  # Пара (4, 4) на индексах 2 и 8
        ([1, 2, 3, 4, 5], (2, 4)),  # Пара (3, 5) на индексах 2 и 4

        # Пограничные случаи
        ([8, 0], (0, 1)),  # Минимальный размер массива
        ([10 ** 9, -10 ** 9], None),  # Пара не найдена, возвращается пустой словарь
        ([10 ** 9, 10 ** 9 - 1, -10 ** 9], None),  # Нет пары с суммой 8

        # Особые случаи
        ([1, 1, 1, 1], None),  # Все числа одинаковые, нет подходящей пары
        ([5, 2, 2, 5, 4], None),  # Нет подходящей пары
        ([5, 2, 3, 5, 4], (0, 2)),  # Пара (3, 5) на индексах 0 и 2
        ([1, 7, 3, 5, 4], (0, 1)),  # Пара (1, 7) на индексах 0 и 1
        ([], None),  # Пустой массив
    ]
)
def test_two_sum(lst, expected_result):
    assert two_sum(lst) == expected_result

